In [15]:
import numpy as np
import pandas as pd

col_name = ['Name']
sit_no = np.arange(1,4)
name = 'Wale Adenuga', 'Prince Ugo', ' Iron Mike'
data = pd.DataFrame( index = sit_no, data =name, columns = col_name) # generating a table using panda note: index is used as the row in panda
data

           Name
1  Wale Adenuga
2    Prince Ugo
3     Iron Mike

In [18]:
data['Age'] = np.random.randint(16,18,3).reshape(3,1)

In [19]:
data

           Name  Exam Score  Age
1  Wale Adenuga          63   16
2    Prince Ugo          44   16
3     Iron Mike          33   17

In [22]:
data['City'] = 'Abuja', 'Lagos', 'UK'
data

           Name  Exam Score  Age   City
1  Wale Adenuga          63   16  Abuja
2    Prince Ugo          44   16  Lagos
3     Iron Mike          33   17     UK

In [31]:
data['Salary'] = 40000, 50000, 60000

In [32]:
data

,Name,Exam Score,Age,City,Salary,Wealth
1,Wale Adenuga,63,16,Abuja,40000,4000040000400004000040000400004000040000400004...
2,Prince Ugo,44,16,Lagos,50000,5000050000500005000050000500005000050000500005...
3,Iron Mike,33,17,UK,60000,6000060000600006000060000600006000060000600006...

In [34]:
 data['multi'] = data['Salary'] * data['Age']
data

,Name,Exam Score,Age,City,Salary,Wealth,multi
1,Wale Adenuga,63,16,Abuja,40000,4000040000400004000040000400004000040000400004...,640000
2,Prince Ugo,44,16,Lagos,50000,5000050000500005000050000500005000050000500005...,800000
3,Iron Mike,33,17,UK,60000,6000060000600006000060000600006000060000600006...,1020000

In [2]:
 data.drop['wealth']
data

NameError: name 'data' is not defined